// Задача 40: Напишите программу, которая принимает на вход три
// числа и проверяет, может ли существовать треугольник с сторонами
// такой длины.
// Теорема о неравенстве треугольника: каждая сторона треугольника
// меньше суммы двух других сторон.

// Задача 42: Напишите программу, которая будет преобразовывать
// десятичное число в двоичное.
// 45 -> 101101
// 3 -> 11
// 2 -> 10

Console.WriteLine("Введите число 1: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число 2: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число 3: ");
int c = Convert.ToInt32(Console.ReadLine());


bool Triangle(int ad, int bd, int cd)
{
return ad< bd + cd && bd < ad + cd && cd < ad + bd;
}
bool res =Triangle(a,b,c);
Console.WriteLine(res ? "Да":"Нет");